{
  "version": 1,
  "n_tokens": 152,
  "vocab": {
    "<PAD>": 0,
    "<UNK>": 1,
    "<BOS>": 2,
    "<EOS>": 3,
    "<NUM>": 4,
    "<RATIO:FATIGUE>": 5,
    "<COUNT:ASSIGNS>": 6,
    "<COUNT:KNOW_VOL>": 7,
    "<COUNT:KNOW_MAX>": 8,
    "<RATIO:KNOW_SPEC>": 9,
    "<COUNT:KNOW_ENT>": 10,
    "<RATIO:MATCH>": 11,
    "<RATIO:MATCH_N1>": 12,
    "<RATIO:MATCH_N2>": 13,
    "<TIME:ETA>": 14,
    "<TIME:LAST_AGE>": 15,
    "<COUNT:PROC_TOT>": 16,
    "<COUNT:IN_BUF>": 17,
    "<COUNT:OUT_BUF>": 18,
    "<COUNT:BD_COUNT>": 19,
    "<TIME:DOWNTIME>": 20,
    "<TIME:MEAN_TBF>": 21,
    "<FOUR:SIM_T>": 22,
    "<TIME:T_AGE>": 23,
    "<COUNT:Q_SIZE>": 24,
    "<COUNT:BROKEN_N>": 25,
    "<COUNT:PROC_N>": 26,
    "<TIME:N1_AGE>": 27,
    "<TIME:N2_AGE>": 28,
    "BUSY=T": 29,
    "BUSY=F": 30,
    "DISRUPT=T": 31,
    "DISRUPT=F": 32,
    "BROKEN=T": 33,
    "BROKEN=F": 34,
    "PROC=T": 35,
    "PROC=F": 36,
    "IS_CURRENT=T": 37,
    "IS_CURRENT=F": 38,
    "HAS_T=T": 39,
    "HAS_T=F": 40,
    "TEMPLATE=default": 41,
    "TEMPLATE=electronics_specialist": 42,
    "TEMPLATE=expert": 43,
    "TEMPLATE=generalist": 44,
    "TEMPLATE=junior": 45,
    "TEMPLATE=motor_specialist": 46,
    "TEMPLATE=senior": 47,
    "TEMPLATE=trainee": 48,
    "M_TYPE=Assembly": 49,
    "M_TYPE=CNC": 50,
    "M_TYPE=Conveyor": 51,
    "M_TYPE=Drill": 52,
    "M_TYPE=Furnace": 53,
    "M_TYPE=Grinder": 54,
    "M_TYPE=Inspection": 55,
    "M_TYPE=Lathe": 56,
    "M_TYPE=Mill": 57,
    "M_TYPE=Packager": 58,
    "M_TYPE=Paint": 59,
    "M_TYPE=Press": 60,
    "M_TYPE=Welder": 61,
    "M_TYPE=generic": 62,
    "T_M_TYPE=Assembly": 63,
    "T_M_TYPE=CNC": 64,
    "T_M_TYPE=Conveyor": 65,
    "T_M_TYPE=Drill": 66,
    "T_M_TYPE=Furnace": 67,
    "T_M_TYPE=Grinder": 68,
    "T_M_TYPE=Inspection": 69,
    "T_M_TYPE=Lathe": 70,
    "T_M_TYPE=Mill": 71,
    "T_M_TYPE=Packager": 72,
    "T_M_TYPE=Paint": 73,
    "T_M_TYPE=Press": 74,
    "T_M_TYPE=Welder": 75,
    "T_M_TYPE=generic": 76,
    "N1_M_TYPE=Assembly": 77,
    "N1_M_TYPE=CNC": 78,
    "N1_M_TYPE=Conveyor": 79,
    "N1_M_TYPE=Drill": 80,
    "N1_M_TYPE=Furnace": 81,
    "N1_M_TYPE=Grinder": 82,
    "N1_M_TYPE=Inspection": 83,
    "N1_M_TYPE=Lathe": 84,
    "N1_M_TYPE=Mill": 85,
    "N1_M_TYPE=Packager": 86,
    "N1_M_TYPE=Paint": 87,
    "N1_M_TYPE=Press": 88,
    "N1_M_TYPE=Welder": 89,
    "N1_M_TYPE=generic": 90,
    "N2_M_TYPE=Assembly": 91,
    "N2_M_TYPE=CNC": 92,
    "N2_M_TYPE=Conveyor": 93,
    "N2_M_TYPE=Drill": 94,
    "N2_M_TYPE=Furnace": 95,
    "N2_M_TYPE=Grinder": 96,
    "N2_M_TYPE=Inspection": 97,
    "N2_M_TYPE=Lathe": 98,
    "N2_M_TYPE=Mill": 99,
    "N2_M_TYPE=Packager": 100,
    "N2_M_TYPE=Paint": 101,
    "N2_M_TYPE=Press": 102,
    "N2_M_TYPE=Welder": 103,
    "N2_M_TYPE=generic": 104,
    "T_M_TYPE=NONE": 105,
    "N1_M_TYPE=NONE": 106,
    "N2_M_TYPE=NONE": 107,
    "CUR_COMP=bearing": 108,
    "CUR_COMP=drive": 109,
    "CUR_COMP=electronics": 110,
    "CUR_COMP=end_effector": 111,
    "CUR_COMP=mechanical": 112,
    "CUR_COMP=motor": 113,
    "CUR_COMP=pump": 114,
    "CUR_COMP=sensor": 115,
    "CUR_COMP=spindle": 116,
    "CUR_COMP=torch": 117,
    "T_C_TYPE=bearing": 118,
    "T_C_TYPE=drive": 119,
    "T_C_TYPE=electronics": 120,
    "T_C_TYPE=end_effector": 121,
    "T_C_TYPE=mechanical": 122,
    "T_C_TYPE=motor": 123,
    "T_C_TYPE=pump": 124,
    "T_C_TYPE=sensor": 125,
    "T_C_TYPE=spindle": 126,
    "T_C_TYPE=torch": 127,
    "N1_C_TYPE=bearing": 128,
    "N1_C_TYPE=drive": 129,
    "N1_C_TYPE=electronics": 130,
    "N1_C_TYPE=end_effector": 131,
    "N1_C_TYPE=mechanical": 132,
    "N1_C_TYPE=motor": 133,
    "N1_C_TYPE=pump": 134,
    "N1_C_TYPE=sensor": 135,
    "N1_C_TYPE=spindle": 136,
    "N1_C_TYPE=torch": 137,
    "N2_C_TYPE=bearing": 138,
    "N2_C_TYPE=drive": 139,
    "N2_C_TYPE=electronics": 140,
    "N2_C_TYPE=end_effector": 141,
    "N2_C_TYPE=mechanical": 142,
    "N2_C_TYPE=motor": 143,
    "N2_C_TYPE=pump": 144,
    "N2_C_TYPE=sensor": 145,
    "N2_C_TYPE=spindle": 146,
    "N2_C_TYPE=torch": 147,
    "CUR_COMP=NONE": 148,
    "T_C_TYPE=NONE": 149,
    "N1_C_TYPE=NONE": 150,
    "N2_C_TYPE=NONE": 151
  }
}
